Tekla Open API Reference for Tekla Structures 2025
DoubleConverter Class
 The DoubleConverter class converts types to and from the double datatype.
Inheritance Hierarchy
System.Object
 System.ComponentModel.TypeConverter
 Tekla.Structures.Datatype.DoubleConverter
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class DoubleConverter : TypeConverter
Public Class DoubleConverter
	Inherits TypeConverter
The DoubleConverter type exposes the following members.
Constructors
Name | Description
DoubleConverter
Initializes a new instance of the DoubleConverter class
Top
Methods
Name | Description
CanConvertFrom
 Checks whether the conversion can be made from the source type to the double datatype.
 (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertTo
 Checks whether the conversion can be made from the double datatype to the destination type.
 (Overrides TypeConverter.CanConvertTo(ITypeDescriptorContext, Type).)
ConvertFrom
 Converts an object from the given culture to the Tekla.Structures.Datatype.Double type.
 (Overrides TypeConverter.ConvertFrom(ITypeDescriptorContext, CultureInfo, Object).)
ConvertTo
 Converts an object from the double datatype to the given destination type.
 (Overrides TypeConverter.ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type).)
Top
See Also
Reference
Tekla.Structures.Datatype Namespace